{
	"version": "https://jsonfeed.org/version/1.1",
	"title": "Simeon Steward",
	"language": "en",
	"home_page_url": "https://simeonsteward.github.io/",
	"feed_url": "https://simeonsteward.github.io/feed/feed.json",
	"description": "Simple Portfolio website to show off my projects",
	"author": {
		"name": "Simeon Steward",
		"url": "https://www.linkedin.com/in/simeonsteward/"
	},
	"items": [
		{
			"id": "https://simeonsteward.github.io/blog/rip_protocol/",
			"url": "https://simeonsteward.github.io/blog/rip_protocol/",
			"title": "RIP Protocol Project",
			"content_html": "<h1 id=\"implementing-the-rip-routing-protocol-in-python\" tabindex=\"-1\">Implementing the RIP Routing Protocol in Python <a class=\"header-anchor\" href=\"https://simeonsteward.github.io/blog/rip_protocol/\">#</a></h1>\n<p>During my study abroad in New Zealand, one of my computer networking courses involved implementing the Routing Information Protocol (RIP) in Python. RIP is a distance-vector routing protocol used to exchange routing information between routers.</p>\n<p>For this project, I worked in collaboration with Adam Venroy to build out an incomplete implementation of RIP v2 as specified in RFC 2453. Our implementation handles the core functionality namely:</p>\n<ul>\n<li>Sending and receiving RIP response messages</li>\n<li>Processing routing table updates</li>\n<li>Managing router timeouts and triggered updates</li>\n<li>Poison reverse to prevent routing loops</li>\n</ul>\n<p>Some limitations of our implementation:</p>\n<ul>\n<li>No authentication</li>\n<li>No support for route tags, subnet masks, or next hops</li>\n<li>Uses port numbers from the config file instead of ip addresses</li>\n<li>Does not handle RIP queries</li>\n</ul>\n<h2 id=\"implementation-details\" tabindex=\"-1\">Implementation Details <a class=\"header-anchor\" href=\"https://simeonsteward.github.io/blog/rip_protocol/\">#</a></h2>\n<p>Each router in our RIP implementation is simulated by a separate Routing Demon process configured from a file specifying the router ID, ports, neighbors, and timers. The Routing Demon opens UDP sockets on its input ports to receive RIP packet updates. Internally, it uses a distance vector table stored in a nested dictionary to track the costs to each known destination router. This table gets populated and updated as RIP responses are received. The demon also maintains its own routing table containing the next hop, interface, metric, and timers for each route. It leverages Python's struct library to encode and decode the raw RIP packet byte arrays. And it implements internal timers to manage timeout of stale routes and triggering rapid updates when the topology changes. The core routing logic and control plane mechanisms were built from scratch in Python without any external libraries. Each Routing Demon serves as an autonomous router emulation able to receive and propagate routing updates through the exchange of RIP packets.</p>\n<h2 id=\"key-components\" tabindex=\"-1\">Key Components <a class=\"header-anchor\" href=\"https://simeonsteward.github.io/blog/rip_protocol/\">#</a></h2>\n<p>Some of the key components we implemented:</p>\n<p>RIP Message Processing - Parses incoming RIP response packets and processes the routing table entries to update the local routing table. This includes validating metrics and router IDs.</p>\n<p>Triggered Updates - Monitors routing changes and can trigger an immediate update to neighbors rather than waiting for the next periodic update. This speeds up convergence.</p>\n<p>Timers - Manages time-based behaviors like timing out stale routes and garbage collecting old deletions.</p>\n<p>Routing Table - Stores routes, metrics, next hops, and timers in a dictionary structure.</p>\n<p>Packet Encoding - Uses Python struct library to encode and decode RIP packet byte arrays.\nLessons Learned</p>\n<h1 id=\"experience-gained\" tabindex=\"-1\">Experience Gained <a class=\"header-anchor\" href=\"https://simeonsteward.github.io/blog/rip_protocol/\">#</a></h1>\n<p>Working on this project gave me hands-on experience with:</p>\n<p>Implementing a real networking protocol from its RFC specification\nPacket encoding and parsing\nManaging router state and time-based behaviors\nOptimizing convergence and stability in a distributed routing algorithm\nPython</p>\n<p>Let me know if you have any other questions! I'm happy to discuss the project in more depth.</p>\n",
			"date_published": "2023-08-23T00:00:00Z"
		}
		
	]
}
