{
	"version": "https://jsonfeed.org/version/1.1",
	"title": "Simeon Steward",
	"language": "en",
	"home_page_url": "https://simeonsteward.github.io/",
	"feed_url": "https://simeonsteward.github.io/feed/feed.json",
	"description": "Simple Portfolio website to show off my projects",
	"author": {
		"name": "Simeon Steward",
		"url": "https://www.linkedin.com/in/simeonsteward/"
	},
	"items": [
		{
			"id": "https://simeonsteward.github.io/blog/dominion_simulator/",
			"url": "https://simeonsteward.github.io/blog/dominion_simulator/",
			"title": "Dominion Simulator Project",
			"content_html": "<h1 id=\"dominion\" tabindex=\"-1\">Dominion <a class=\"header-anchor\" href=\"https://simeonsteward.github.io/blog/dominion_simulator/\">#</a></h1>\n<p>I learned dominion at a fairly young age, and was highly competive in my teens. In 2018, I took fourth place in the world championship, and at one point for a couple of hours I was the highest rated player on the leaderboard. This passion for dominion has combined with my desire to write software and I began creating a dominion simulator.\nThe idea behind this dominion simulator, is that the user can create two strategies, and the program will quickly simulate 10s of thousands of games between them to let the user know how much better a given strategy is compared to another. This project is not the first dominion simulator, and is inspired by Geronimoo's dominion simulator.\nDominion is a deck builder created by Donald X. Vaccarino in 2009. Each game 10 cards are choosen from a massive pool of 366 cards. Because every game has different cards, strategies that exist on one kingdom simply don't exist in others because the cards are different. Because of this, it is helpful to know the relative strength of many different strategies. As a human who has played thousands of games, I have developed a decent intuition on what is good, but it is really helpful to have numbers to either back me up or change my mind so that people can become even better at dominion.</p>\n<h3 id=\"why-rust\" tabindex=\"-1\">Why Rust?? <a class=\"header-anchor\" href=\"https://simeonsteward.github.io/blog/dominion_simulator/\">#</a></h3>\n<p>For this project, I choose to use rust because</p>\n<ul>\n<li>The type system is very expressive, allowing me to model dominion in a more complete way, and in a way that ensures that I implement functionality for every card of a type</li>\n<li>Memory safety is guaranteed</li>\n<li>Rust is fast</li>\n</ul>\n<h3 id=\"this-project-has-to-do-implement\" tabindex=\"-1\">This project has to do implement <a class=\"header-anchor\" href=\"https://simeonsteward.github.io/blog/dominion_simulator/\">#</a></h3>\n<ul>\n<li>Game engine\n<ul>\n<li>Drawing, discarding, playing, buying, playing and trashing cards</li>\n<li>Manage player state</li>\n<li>Check game end conditions</li>\n</ul>\n</li>\n<li>Strategy\n<ul>\n<li>Buy strategy</li>\n<li>Play strategy</li>\n<li>Save and load strategies</li>\n<li>User create strategies</li>\n</ul>\n</li>\n<li>All 366 cards need to be implemented</li>\n</ul>\n<h3 id=\"extensions-to-this-project\" tabindex=\"-1\">Extensions to this project <a class=\"header-anchor\" href=\"https://simeonsteward.github.io/blog/dominion_simulator/\">#</a></h3>\n<ul>\n<li>User interface for ease of use</li>\n<li>Support to pit multiple strategies against each other to create a table of dominion strategies with their relative strengths</li>\n<li>Performance optimization</li>\n<li>Support to simulate strategies from a certain game state</li>\n<li>Support to auto create strategies\n<ul>\n<li>Auto pit them against each other</li>\n<li>Find best strategies for a kingdom</li>\n</ul>\n</li>\n</ul>\n<h3 id=\"progress\" tabindex=\"-1\">Progress <a class=\"header-anchor\" href=\"https://simeonsteward.github.io/blog/dominion_simulator/\">#</a></h3>\n<p>I started this project in the June 2023, and have the basic game engine implemented, and am working on implementing user creating, loading and saving strategies.</p>\n<h3 id=\"lessons-learned\" tabindex=\"-1\">Lessons learned <a class=\"header-anchor\" href=\"https://simeonsteward.github.io/blog/dominion_simulator/\">#</a></h3>\n<p>Rust has a very fussy compiler. This is both a good and a bad thing. On the bright side, because it is so fussy, when you get the code to pass the compiler, it usually works how you intend it to, another great feature of the compiler is that the error messages often tell you exactly what you need to do to fix the problem.\nOne downside of rust is that borrow checker can make it hard to use reuse references that could be easily done in a garbage collected language, or a manual allocated language. This project has helped me learn to deal with the borrowed refrences and lifetimes. Rust's type system and match statements are really enjoyable to use and ensure that all cases of enums are handled which is a commonly used throughout the project.</p>\n<p>You can see the source code right here: https://github.com/SimeonSteward/dominion_simulator</p>\n",
			"date_published": "2023-08-29T00:00:00Z"
		}
		,
		{
			"id": "https://simeonsteward.github.io/blog/rip_protocol/",
			"url": "https://simeonsteward.github.io/blog/rip_protocol/",
			"title": "RIP Protocol Project",
			"content_html": "<h1 id=\"implementing-the-rip-routing-protocol-in-python\" tabindex=\"-1\">Implementing the RIP Routing Protocol in Python <a class=\"header-anchor\" href=\"https://simeonsteward.github.io/blog/rip_protocol/\">#</a></h1>\n<p>During my study abroad in New Zealand, one of my computer networking courses involved implementing the Routing Information Protocol (RIP) in Python. RIP is a distance-vector routing protocol used to exchange routing information between routers.</p>\n<p>For this project, I worked in collaboration with Adam Venroy to build out an incomplete implementation of RIP v2 as specified in RFC 2453. Our implementation handles the core functionality namely:</p>\n<ul>\n<li>Sending and receiving RIP response messages</li>\n<li>Processing routing table updates</li>\n<li>Managing router timeouts and triggered updates</li>\n<li>Poison reverse to prevent routing loops</li>\n</ul>\n<p>Some limitations of our implementation:</p>\n<ul>\n<li>No authentication</li>\n<li>No support for route tags, subnet masks, or next hops</li>\n<li>Uses port numbers from the config file instead of ip addresses</li>\n<li>Does not handle RIP queries</li>\n</ul>\n<h2 id=\"implementation-details\" tabindex=\"-1\">Implementation Details <a class=\"header-anchor\" href=\"https://simeonsteward.github.io/blog/rip_protocol/\">#</a></h2>\n<p>Each router in our RIP implementation is simulated by a separate Routing Demon process configured from a file specifying the router ID, ports, neighbors, and timers. The Routing Demon opens UDP sockets on its input ports to receive RIP packet updates. Internally, it uses a distance vector table stored in a nested dictionary to track the costs to each known destination router. This table gets populated and updated as RIP responses are received. The demon also maintains its own routing table containing the next hop, interface, metric, and timers for each route. It leverages Python's struct library to encode and decode the raw RIP packet byte arrays. And it implements internal timers to manage timeout of stale routes and triggering rapid updates when the topology changes. The core routing logic and control plane mechanisms were built from scratch in Python without any external libraries. Each Routing Demon serves as an autonomous router emulation able to receive and propagate routing updates through the exchange of RIP packets.</p>\n<h2 id=\"key-components\" tabindex=\"-1\">Key Components <a class=\"header-anchor\" href=\"https://simeonsteward.github.io/blog/rip_protocol/\">#</a></h2>\n<p>Some of the key components we implemented:</p>\n<p>RIP Message Processing - Parses incoming RIP response packets and processes the routing table entries to update the local routing table. This includes validating metrics and router IDs.</p>\n<p>Triggered Updates - Monitors routing changes and can trigger an immediate update to neighbors rather than waiting for the next periodic update. This speeds up convergence.</p>\n<p>Timers - Manages time-based behaviors like timing out stale routes and garbage collecting old deletions.</p>\n<p>Routing Table - Stores routes, metrics, next hops, and timers in a dictionary structure.</p>\n<p>Packet Encoding - Uses Python struct library to encode and decode RIP packet byte arrays.\nLessons Learned</p>\n<h1 id=\"experience-gained\" tabindex=\"-1\">Experience Gained <a class=\"header-anchor\" href=\"https://simeonsteward.github.io/blog/rip_protocol/\">#</a></h1>\n<p>Working on this project gave me hands-on experience with:</p>\n<p>Implementing a real networking protocol from its RFC specification\nPacket encoding and parsing\nManaging router state and time-based behaviors\nOptimizing convergence and stability in a distributed routing algorithm\nPython</p>\n<p>Let me know if you have any other questions! I'm happy to discuss the project in more depth.</p>\n",
			"date_published": "2023-08-23T00:00:00Z"
		}
		
	]
}
